Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAK176.atdf
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 13" name="ADCEISTAT1__EIRDY13">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 14" name="ADCEISTAT1__EIRDY14">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 15" name="ADCEISTAT1__EIRDY15">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 16" name="ADCEISTAT1__EIRDY16">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 17" name="ADCEISTAT1__EIRDY17">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 18" name="ADCEISTAT1__EIRDY18">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 19" name="ADCEISTAT1__EIRDY19">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 20" name="ADCEISTAT1__EIRDY20">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 21" name="ADCEISTAT1__EIRDY21">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 22" name="ADCEISTAT1__EIRDY22">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 23" name="ADCEISTAT1__EIRDY23">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 24" name="ADCEISTAT1__EIRDY24">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 25" name="ADCEISTAT1__EIRDY25">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 26" name="ADCEISTAT1__EIRDY26">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 27" name="ADCEISTAT1__EIRDY27">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 28" name="ADCEISTAT1__EIRDY28">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 29" name="ADCEISTAT1__EIRDY29">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
