Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAK176.atdf
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1" />
         <value caption="Device was not in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1" />
         <value caption="Device was not in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RCON__DMTO">
         <value caption="A DMT time-out has occurred" name="" value="0x1" />
         <value caption="A DMT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset was not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset (MCLR) Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="A Configuration Mismatch Reset has occurred" name="" value="0x1" />
         <value caption="A Configuration Mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary/Secondary Configuration Registers Error Flag bit" name="RCON__BCFGFAIL">
         <value caption="An error occurred during a read of the primary and alternate configuration registers" name="" value="0x1" />
         <value caption="No error occurred during a read of the primary and alternate configuration registers" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary Configuration Registers Error Flag bit" name="RCON__BCFGERR">
         <value caption="An error occurred during a read of the primary configuration registers" name="" value="0x1" />
         <value caption="No error occurred during a read of the primary configuration registers" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable software Reset event" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="NMI Reset Counter Value bits" name="RNMICON__NMICNT">
         <value caption="65535 SYSCLK cycles before a device Reset occurs" name="" value="0xffff" />
         <value caption="1 SYSCLK cycle before a device Reset occurs" name="" value="0x1" />
         <value caption="No delay between NMI assertion and device Reset event" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out in Sleep Mode Flag bit" name="RNMICON__WDTS">
         <value caption="WDT time-out has occurred during Sleep mode and caused a wake-up from sleep" name="" value="0x1" />
         <value caption="WDT time-out has not occurred during Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
         <value caption="FSCM has detected clock failure and caused an NMI" name="" value="0x1" />
         <value caption="FSCM has not detected clock failure" name="" value="0x0" />
      </value-group>
      <value-group caption="General NMI bit" name="RNMICON__GNMI">
         <value caption="A general NMI event has been detected or a user-initiated NMI event has occurred" name="" value="0x1" />
         <value caption="A general NMI event has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Software NMI Trigger" name="RNMICON__SWNMI">
         <value caption="An NMI will be generated" name="" value="0x1" />
         <value caption="An NMI will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-Out Flag bit" name="RNMICON__WDTO">
         <value caption="WDT time-out has occurred and caused a NMI" name="" value="0x1" />
         <value caption="WDT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RNMICON__DMTO">
         <value caption="DMT time-out has occurred and caused a NMI" name="" value="0x1" />
         <value caption="DMT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Regulator Stand-by Enable bit" name="PWRCON__VREGS">
         <value caption="Voltage regulator will remain active during Sleep" name="" value="0x1" />
         <value caption="Voltage regulator will go to Stand-by mode during Sleep" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01461" name="CTMU" version="1">
      <register-group name="CTMU">
         <register caption="CTMU Control Register" name="CTMUCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Current Range Select bits" mask="0x00000003" name="IRNG" values="CTMUCON__IRNG" />
            <bitfield caption="Current Source Trim bits" mask="0x000000FC" name="ITRIM" values="CTMUCON__ITRIM" />
            <bitfield caption="Trigger Control bit" mask="0x00000100" name="CTTRIG" values="CTMUCON__CTTRIG" />
            <bitfield caption="Analog Current Source Control bit" mask="0x00000200" name="IDISSEN" values="CTMUCON__IDISSEN" />
            <bitfield caption="Edge Sequence Enable bit" mask="0x00000400" name="EDGSEQEN" values="CTMUCON__EDGSEQEN" />
            <bitfield caption="Edge Enable bit" mask="0x00000800" name="EDGEN" values="CTMUCON__EDGEN" />
            <bitfield caption="Time Generation Enable bit" mask="0x00001000" name="TGEN" values="CTMUCON__TGEN" />
            <bitfield caption="Stop-in-Idle Mode bit" mask="0x00002000" name="CTMUSIDL" values="CTMUCON__CTMUSIDL" />
            <bitfield caption="ON Enable bit" mask="0x00008000" name="ON" values="CTMUCON__ON" />
            <bitfield caption="Edge 2 Source Select bits" mask="0x000F0000" name="EDG2SEL" values="CTMUCON__EDG2SEL" />
            <bitfield caption="Edge 2 Polarity Select bit" mask="0x00400000" name="EDG2POL" values="CTMUCON__EDG2POL" />
            <bitfield caption="Edge2 Edge Sampling Select bit" mask="0x00800000" name="EDG2MOD" values="CTMUCON__EDG2MOD" />
            <bitfield caption="Edge1 Status bit" mask="0x01000000" name="EDG1STAT" values="CTMUCON__EDG1STAT" />
            <bitfield caption="Edge2 Status bit" mask="0x02000000" name="EDG2STAT" values="CTMUCON__EDG2STAT" />
            <bitfield caption="Edge 1 Source Select bits" mask="0x3C000000" name="EDG1SEL" values="CTMUCON__EDG1SEL" />
            <bitfield caption="Edge 1 Polarity Select bit" mask="0x40000000" name="EDG1POL" values="CTMUCON__EDG1POL" />
            <bitfield caption="Edge1 Edge Sampling Select bit" mask="0x80000000" name="EDG1MOD" values="CTMUCON__EDG1MOD" />
         </register>
      </register-group>
      <value-group caption="Current Range Select bits" name="CTMUCON__IRNG">
         <value caption="100 times base current" name="" value="0x3" />
         <value caption="10 times base current" name="" value="0x2" />
         <value caption="Base current level" name="" value="0x1" />
         <value caption="1000 times base current(4)" name="" value="0x0" />
      </value-group>
      <value-group caption="Current Source Trim bits" name="CTMUCON__ITRIM">
         <value caption="Maximum positive change from nominal current" name="" value="0x1f" />
         <value caption="" name="" value="0x1e" />
         <value caption="Minimum positive change from nominal current" name="" value="0x1" />
         <value caption="Nominal current output specified by IRNG" name="" value="0x0" />
         <value caption="Minimum negative change from nominal current" name="" value="0x3f" />
         <value caption="" name="" value="0x22" />
         <value caption="Maximum negative change from nominal current" name="" value="0x21" />
      </value-group>
      <value-group caption="Trigger Control bit" name="CTMUCON__CTTRIG">
         <value caption="Trigger output is enabled" name="" value="0x1" />
         <value caption="Trigger output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Current Source Control bit" name="CTMUCON__IDISSEN">
         <value caption="Analog current source output is grounded" name="" value="0x1" />
         <value caption="Analog current source output is not grounded" name="" value="0x0" />
      </value-group>
