Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAK176.atdf
      <value-group caption="RMII Speed bit" name="EMAC1SUPP__SPEEDRMII">
         <value caption="RMII is running at 100 Mbps" name="" value="0x1" />
         <value caption="RMII is running at 10 Mbps" name="" value="0x0" />
      </value-group>
      <value-group caption="Reset RMII Logic bit" name="EMAC1SUPP__RESETRMII">
         <value caption="Reset the MAC RMII module" name="" value="0x1" />
         <value caption="Normal operation." name="" value="0x0" />
      </value-group>
      <value-group caption="Shortcut PAUSE Quanta bit" name="EMAC1TEST__SHRTQNTA">
         <value caption="The MAC reduces the effective PAUSE Quanta from 64 byte-times to 1 byte-time" name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Test PAUSE bit" name="EMAC1TEST__TESTPAUSE">
         <value caption="The MAC Control sub-layer will inhibit transmissions" name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Test Backpressure bit" name="EMAC1TEST__TESTBP">
         <value caption="The MAC will assert backpressure on the link. Backpressure causes preamble to be transmitted" name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Scan Increment bit" name="EMAC1MCFG__SCANINC">
         <value caption="The MII Management module will perform read cycles across a range of PHYs. The read cycles will start from address 1 through the value set in EMAC1MADR" name="" value="0x1" />
         <value caption="Continuous reads of the same PHY" name="" value="0x0" />
      </value-group>
      <value-group caption="Suppress Preamble bit" name="EMAC1MCFG__NOPRE">
         <value caption="The MII Management will perform read/write cycles without the 32-bit preamble field. Some PHYs support suppressed preamble" name="" value="0x1" />
         <value caption="Normal read/write cycles are performed" name="" value="0x0" />
      </value-group>
      <value-group caption="Test Reset MII Management bit" name="EMAC1MCFG__RESETMGMT">
         <value caption="Reset the MII Management module" name="" value="0x1" />
         <value caption="Normal Operation" name="" value="0x0" />
      </value-group>
      <value-group caption="MII Management Read Command bit" name="EMAC1MCMD__READ">
         <value caption="The MII Management module will perform a single read cycle. The read data is returned in the EMAC1MRDD register" name="" value="0x1" />
         <value caption="The MII Management module will perform a write cycle. The write data is taken from the EMAC1MWTD register" name="" value="0x0" />
      </value-group>
      <value-group caption="MII Management Scan Mode bit" name="EMAC1MCMD__SCAN">
         <value caption="The MII Management module will perform read cycles continuously (for example" name="" value="0x1" />
         <value caption="Normal Operation" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00160" name="GLCD" version="1">
      <register-group name="GLCD">
         <register caption="Graphics LCD Controller Mode Register" name="GLCDMODE" offset="0x0" rw="RW" size="4">
            <bitfield caption="RGB Sequential Modes bit" mask="0x000000E0" name="RGBSEQ" values="GLCDMODE__RGBSEQ" />
            <bitfield caption="Formatting Clock Divide Enable bit" mask="0x00000100" name="FORMATCLK" values="GLCDMODE__FORMATCLK" />
            <bitfield caption="YUV Output Enable bit" mask="0x00000200" name="YUVOUTPUT" values="GLCDMODE__YUVOUTPUT" />
            <bitfield caption="Force Output to Blank bit" mask="0x00080000" name="FORCEBLANK" values="GLCDMODE__FORCEBLANK" />
            <bitfield caption="Palette Gamma Ramp Enable bit" mask="0x00100000" name="PGRAMPEN" values="GLCDMODE__PGRAMPEN" />
            <bitfield caption="Pixel Clock Out Polarity bit" mask="0x00400000" name="PCLKPOL" values="GLCDMODE__PCLKPOL" />
            <bitfield caption="Vertical Sync for Single Cycle Per Line Enable bit" mask="0x00800000" name="VSYNCCYC" values="GLCDMODE__VSYNCCYC" />
            <bitfield caption="Dithering Enable bit" mask="0x01000000" name="DITHER" values="GLCDMODE__DITHER" />
            <bitfield caption="DE Polarity bit" mask="0x04000000" name="DEPOL" values="GLCDMODE__DEPOL" />
            <bitfield caption="Horizontal Sync Polarity bit" mask="0x08000000" name="HSYNCPOL" values="GLCDMODE__HSYNCPOL" />
            <bitfield caption="Vertical Sync Polarity bit" mask="0x10000000" name="VSYNCPOL" values="GLCDMODE__VSYNCPOL" />
            <bitfield caption="Programmable Cursor Enable bit" mask="0x40000000" name="CURSOREN" values="GLCDMODE__CURSOREN" />
            <bitfield caption="LCD Controller Module Enable bit" mask="0x80000000" name="LCDEN" values="GLCDMODE__LCDEN" />
         </register>
         <register caption="Graphics LCD Controller Clock Control Register" name="GLCDCLKCON" offset="0x4" rw="RW" size="4">
            <bitfield caption="Clock Divider bits" mask="0x0000003F" name="CLKDIV" values="GLCDCLKCON__CLKDIV" />
            <bitfield mask="0x00003F00" name="LPREFETCH" />
         </register>
         <register caption="Graphics LCD Controller Background Color Register" name="GLCDBGCOLOR" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="ALPHA" />
            <bitfield mask="0x0000FF00" name="BLUE" />
            <bitfield mask="0x00FF0000" name="GREEN" />
            <bitfield mask="0xFF000000" name="RED" />
         </register>
         <register caption="Graphics LCD Controller Resolution Register" name="GLCDRES" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RESY" />
            <bitfield mask="0x07FF0000" name="RESX" />
         </register>
         <register caption="Graphics LCD Controller Front Porch Register" name="GLCDFPORCH" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="FPORCHY" />
            <bitfield mask="0x07FF0000" name="FPORCHX" />
         </register>
         <register caption="Graphics LCD Controller Blanking Register" name="GLCDBLANKING" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="BLANKINGY" />
            <bitfield mask="0x07FF0000" name="BLANKINGX" />
         </register>
         <register caption="Graphics LCD Controller Back Porch Register" name="GLCDBPORCH" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="BPORCHY" />
            <bitfield mask="0x07FF0000" name="BPORCHX" />
         </register>
         <register caption="Graphics LCD Controller Cursor Register" name="GLCDCURSOR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="CURSORY" />
            <bitfield mask="0x07FF0000" name="CURSORX" />
         </register>
         <register caption="Graphics LCD Controller Layer x Mode Register (X = 0-2)" name="GLCDL0MODE" offset="0x30" rw="RW" size="4">
            <bitfield caption="Color Mode bits" mask="0x0000000F" name="COLORMODE" values="GLCDL0MODE__COLORMODE" />
            <bitfield caption="Source Blending Function bits" mask="0x00000F00" name="SRCBLEND" values="GLCDL0MODE__SRCBLEND" />
            <bitfield caption="Destinary Blending Function bits" mask="0x0000F000" name="DESTBLEND" values="GLCDL0MODE__DESTBLEND" />
            <bitfield mask="0x00FF0000" name="ALPHA" />
            <bitfield caption="Premultiply Image Alpha bit" mask="0x10000000" name="MULALPHA" values="GLCDL0MODE__MULALPHA" />
            <bitfield caption="Force Alpha with Global Alpha bit" mask="0x20000000" name="FORCEALPHA" values="GLCDL0MODE__FORCEALPHA" />
            <bitfield caption="Disable Bilinear Filtering bit" mask="0x40000000" name="DISABIFIL" values="GLCDL0MODE__DISABIFIL" />
            <bitfield caption="Layer Enable bit" mask="0x80000000" name="LAYEREN" values="GLCDL0MODE__LAYEREN" />
         </register>
         <register caption="Graphics LCD Controller Layer x Mode Register (X = 0-2)" name="GLCDL1MODE" offset="0x50" rw="RW" size="4">
            <bitfield caption="Color Mode bits" mask="0x0000000F" name="COLORMODE" values="GLCDL1MODE__COLORMODE" />
            <bitfield caption="Source Blending Function bits" mask="0x00000F00" name="SRCBLEND" values="GLCDL1MODE__SRCBLEND" />
            <bitfield caption="Destinary Blending Function bits" mask="0x0000F000" name="DESTBLEND" values="GLCDL1MODE__DESTBLEND" />
            <bitfield mask="0x00FF0000" name="ALPHA" />
            <bitfield caption="Premultiply Image Alpha bit" mask="0x10000000" name="MULALPHA" values="GLCDL1MODE__MULALPHA" />
            <bitfield caption="Force Alpha with Global Alpha bit" mask="0x20000000" name="FORCEALPHA" values="GLCDL1MODE__FORCEALPHA" />
            <bitfield caption="Disable Bilinear Filtering bit" mask="0x40000000" name="DISABIFIL" values="GLCDL1MODE__DISABIFIL" />
            <bitfield caption="Layer Enable bit" mask="0x80000000" name="LAYEREN" values="GLCDL1MODE__LAYEREN" />
         </register>
